docs: move database diagram to mermaid format
